import {
  Egypt1,
  Egypt2,
  Egypt4,
  Egypt5,
  Egypt6,
  Egypt7,
  turkey1,
  turkey2,
  turkey4,
  turkey5,
} from "@/public/assets";
import { Car, Hotel, Mountain, PlaneLanding } from "lucide-react";
export const services = [
  {
    title: "حجز سكن",
    text: "نقدم لكم خدمة الحجوزات في أفضل الفنادق والشقق ذات الإطلالة الرائعة والقريبة من جميع.",
    icon: Hotel,
  },
  {
    title: "حجز سيارة",
    text: "نقدم لكم خدمة حجز السيارات سواءً سيارات الأوتوماتيك أو السيارات العادي.",
    icon: Car,
  },
  {
    title: "جولات سياحية",
    text: "جولات سياحية خاصة مع أمهر السائقين كما نقدم جولات جماعية بأحدث الباصات مع أفضل المرشدين السياحيين الذين يُجيدون اللغة العربية ولإنجليزية.",
    icon: Mountain,
  },
  {
    title: "الاستقبال من المطار",
    text: "نقدم لكم خدمة الاستقبال من المطار وتوديعكم في المطار بحيث يكون مندوبنا متواجد دائمًا في خدمتكم أثناء وصولكم أو ذهابكم للمطار مع أفضل وسائل النقل.",
    icon: PlaneLanding,
  },
];

export const toursCards = [
  {
    title: `رحلة إلى الأهرامات في مصر.`,
    text: `تتصف أهرامات مصر الثلاثة بأنها أحد أهم عجائب الدنيا السبعة في
    جمهورية مصر تقع على هضبة الجيزة في محافظة الجيزة.`,
    img: Egypt1,
    price: 178.99,
    link: "tours/egypt",
    bgColor:"#bbc966a8"
  },
  {
    title: `
    رحلة إلى مدينة إسطنبول في تركيا.
    `,
    text: `إسطنبول هي واحدة من أكبر و أجمل مدن تركيا وهي مصنفة ضمن أكثر
    المدن السياحية جذباً للسياح في العالم وتُعتبر إسطنبول الخيار
    الأول للسياح`,
    img: turkey1,
    price: 1100.99,
    link: "tours/turkey",
    bgColor:"#597cd6a8"
  },
];

export const egyptTour = [
  {
    titles: [
      "رحلة إلى الأهرامات في مصر.",
      "الشكل الهرمي:",
      "الهرم الأكبر أو هرم خوفو",
      "هرم خفرع",
      "هرم منكاورع",
    ],
    points: [
      `رحلة إلى الأهرامات في مصر.
    الوصف: تتصف أهرامات مصر الثلاثة بأنها أحد أهم عجائب الدنيا السبعة في جمهورية مصر تقع على هضبة الجيزة في محافظة الجيزة، أيضًا تقع على الضفة الغربية لنهر النيل، وهي تشمل ثلاثة أهرامات وهم خوفو، خفرع، منقرع، والتي بنيت قبل حوالي 25 قرنًا قبل الميلاد.
    وهي مقابر ملكية كل منها يحمل اسم الملك الذي بناه والذي دفن فيه. وأفضل الأنشطة التي يمكنكم القيام بها في هذه الرحلة: يمكنكم الاستمتاع بجولة على ظهر الجمل، إذ تستطيعوا استئجار جمل والقيام بجولة حول هذه الأهرامات لتروا ضخامتها وعظمة بناء هذه الأهرامات قبل آلاف السنين، وتستطيعوا التقاط أجمل الصور التذكارية هناك`,

      `أما عن فكرة الهرم تحديدًا فقد ارتبط الشكل الهرمي لديهم بفكرة نشأة الكون واعتقدوا كذلك طبقًا لبعض كتاباتهم و نصوصهم الدينية أن الهرم وسيله تساعد روح المتوفى في الوصول إلى السماء مع المعبود رع .`,
      `هو أكثر آثار العالم إثارة للجدل والخيال، والوحيد من عجائب الدنيا السبع الباقي إلى الآن، روج الكثيرون حوله الكثير من الأساطير والروايات، فأشاع البعض أن ساكني قارة أطلنطس المفقودة هم بناة الأهرام، وافترض البعض الآخر أن عمالقة من تحت الأرض صعدوا لبناء هذا الهرم.`,
      `هو أحد أهرامات الجيزة في مصر. بناه الملك خفرع رابع ملوك الأسرة الرابعة ابن الملك خوفو. تزوج من الأميرة مراس عنخ. حكم ست وعشرين سنة. بني الهرم الثاني من أهرام الجيزة، وهو أقل ارتفاعا من هرم أبيه(خوفو). كان ارتفاعه 143مترا والآن 136مترا.`,
      `هو أحد أهرامات الجيزة في مصر. بناه الفرعون منكاورع ابن الملك خفرع. طول كل ضلع من أضلاعه 108.5 متراً وارتفاعه 65.5 متراً ، والآن 62 متراً بعد سقوط كسوته الخارجية.`,
    ],
    images: [Egypt2, Egypt4, Egypt5, Egypt6, Egypt7],
  },
];
export const turkeyTour = [
  {
    titles: [
      "متحف آيا صوفيا",
      "قصر توب كابي",
      " برج غالاتا",
      "جامع أيوب سلطان",
    ],
    points: [
      "عُرف في العصر العُثماني باسم الجامع الكبير الشريف لآيا صوفيا، يقع على الضفة الأوروبيَّة في مدينة إسطنبول وهو من أشهر المعالم في تركيا التي يحرص الجميع على زيارتها أثناء جولات السياحة في إسطنبول.",
      "من أفضل الأماكن السياحية في إسطنبول الموصي بزيارتها لمعرفة كيف كانت تُدار شئون الحياة والحكم في ظل الخلافة العثمانية بتركيا طيلة 4 قرون يستعرض المتحف العظيم أحداثها وتفاصيلها.",
      "برج غالاتا هو برج تاريخي عريق يُقال أنه بُنِي عام 507 م ثم تعرض البرج لزلزال قوي أثر عليه تأثيراً بالغًا، بعدها تم اعادة ترميمه وبُنِي على الطراز الرومانسكي في القرن الـ 14، وفي هذا الوقت كان أطول مبنى في اسطنبول.",
      " مسجد عثماني قديم موجود في منطقة أيوب في الجانب الأوروبي من مدينة إسطنبول، بالقرب من منطقة القرن الذهبي، ويقع خارج أسوار القسطنطينية، إذ بني المسجد عام 1458 أي بعد خمس سنوات من فتح القسطنطينية، وهو أول مسجد بناه المسلمون في إسطنبول بعد فتح القسطنطينية عام 1453.",
    ],
    images: [turkey1, turkey2, turkey4, turkey5],
  },
];
