import { Car, Hotel, Mountain, PlaneIcon } from "lucide-react";
export const services = [
  {
    title: "حجز سكن",
    text: "نقدم لكم خدمة الحجوزات في أفضل الفنادق والشقق ذات الإطلالة الرائعة والقريبة من جميع.",
    icon: Hotel,
  },
  {
    title: "حجز سيارة",
    text: "نقدم لكم خدمة حجز السيارات سواءً سيارات الأوتوماتيك أو السيارات العادي.",
    icon: Car,
  },
  {
    title: "جولات سياحية",
    text: "جولات سياحية خاصة مع أمهر السائقين كما نقدم جولات جماعية بأحدث الباصات مع أفضل المرشدين السياحيين الذين يُجيدون اللغة العربية ولإنجليزية.",
    icon: Mountain,
  },
  {
    title: "الاستقبال من المطار",
    text: "نقدم لكم خدمة الاستقبال من المطار وتوديعكم في المطار بحيث يكون مندوبنا متواجد دائمًا في خدمتكم أثناء وصولكم أو ذهابكم للمطار مع أفضل وسائل النقل.",
    icon: PlaneIcon,
  },
];
